Revit 2026 API

# JunctionType Enumeration

---

An enumerated type listing all the junction types for MEP curve types.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum JunctionType
```
```vb
Public Enumeration JunctionType
```
```cpp
public enum class JunctionType
```
```fsharp
type JunctionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Tap | 0 | The junction type is tap. |
| Tee | 1 | The junction type is tee. |

#### Reference

Autodesk.Revit.DB Namespace